combine.org
#+INCLUDE: ./universalOrgPreface.txt

#+TITLE: CombineLib

* COMMENT hidden from document
    ---
** DONE cleanup tanglelib
   Closed: [2016-04-25 Mon 10:05]

** TODO extend report_notcalleby to accept multiple function arguments
** DONE factor installation out of combining
   CLOSED: [2016-05-26 Thu 11:31]
** TODO then, add installation in each major tangler

** DONE move from tangle to COMBINE
   CLOSED: [2016-05-26 Thu 11:30]
** DONE add combine_mkapp, combine_mksh
   CLOSED: [2016-05-17 Tue 11:23]

* Combine and Install Introduction 

This  paper is  part of  my [[http://mcgowans.org/marty3/commonplace][Commonplace  Book.]] It  introduces a  shell
function library, *combinelib*.  This  function library allow users to
compose files  from reusable  smaller files,  combine them  in various
methods, and install those combinations in a run-time environment.

If necessary, the user may have  to supply an intermediate toolkit if,
for  example   /compiling/  is  required.   Otherwise,   for  all-text
situations, this library is a complete package.

The  library  contains functions  from  the  [[./shelf.org][SHELF Standard]].   In  the
language of  that standard, two  families *combine* and  *install* are
presented.  A  function family  has a parent  function, any  number of
sub-functions, and  like-named variables.   For example  the *combine*
family   has   a   function  named   ~combine~   and   ~combine_init~,
~combine_one,~   ...    and   shell  variables   named   COMBINE_FROM,
COMBINE_TO, and so forth.

The  /combine/ functions  combine individual  file fragments  from the
COMBINE_FROM  directory, defaulting  to  ~./inc~  into the  COMBINE_TO
directory,  defaulting  to ~./src~  from  which  they may  be  further
optionally compiled and installed into run-time locations.

The /install/ tools  install tools from the  INSTALL_FROM directory to
the INSTALL_TO directory, whether /combined/ or not.

The shell variables  default to make the  process seamless: COMBINE_TO
and INSTALL_FROM are the same location.

A bootstrap is also supplied.   Once the *combinelib* is installed by
the bootstrap, it is ready for use in other cases.

* Usage, operations

These are in sequence, since combining occurs before installation.

The emacs user  /tangles/ this file into all the  other file fragments
needed to ~combine~ and ~install~ the function families.

The non-emacs  user finds the  tangled components in  their respective
places in the [[https://github.com/applemcg/combine][github repo: combine]].

#+BEGIN_EXAMPLE

 COMBINE, followed by INSTALL
 ----------------------------

       inc/~.all
       ---------
           + <------+ @ file
           V        + @ file
      ( COMBINE )   + ...
           | 
           V
       src/~.out
       ---------
           + <---| src/~.install
           V
      ( INSTALL ) 
           |
           V
       ---------	 
      INSTALL_OUT/~

#+END_EXAMPLE

This companion table shows how default suffix and directory names
are mapped onto shell variables. 


  | pref       | COMBINE | INSTALL |
  |------------+---------+---------|
  | directory: |         |         |
  |------------+---------+---------|
  | inc        | _FROM   |         |
  | src        | _TO     | _FROM   |
  |------------+---------+---------|
  | suffix:    |         |         |
  |------------+---------+---------|
  | all        | _SRC    |         |
  | out        | _OUT    | _SRC    |
  | install    |         | _CMD    |

For  example   COMBINE_TO  and  INSTALL_FROM  both   share  the  /src/
directory.  And /install/  is the name of an  INSTALL_CMD suffix.  All
may be customized.

** combine

*** files

From a file named /something/.all, where *all* is the default for *COMBINE_SUF*,
with zero or more recursive ~@include~ directives, produce /something/.out,
where *out* is the default for *COMBINE_OUT*

Here's a sample input file
: @include aux.0
: @include aux.1
:  ...
: @include report.all
: @include stack.0
: @include trace.0
:  ...

*** commands

Run either  of these  commands to  combine the  file fragments  into a
useful file:

: $ include file.${COMBINE_SUF} > file.${COMBINE_OUT} 2> file.err
: $ combine_mk       # in the parent directory of COMBINE_ALL

** install

Installation happens from the  INSTALL_FROM directory.  It's default is
the COMBINE_TO directory.   It may be as simple  as ~./src~, relative
to  the current  directory.  Files  in  that directory  named with  an
INSTALL_CMD suffix,  defaulting to  *install* direct  the installation
process.   Files with the suffix INSTALL_SRC are moved (linked, copied)
as executable to either, in order:
1. the INSTALL_TO directory, if set, 
1. a previously installed executable location:  ~which file~, or
1. the user's HOME/bin
An non-existent  installation directory is gratuitously  created if it
does not previously exist.

*** a file

An installation file looks like:
: install_bin combine
: install_app include

Where    the   available    user    commands    are   the    functions
*install_{bin,app}*,   where  the   _bin   installs   /file/  in   the
INSTALL_TO/{file}lib. The _app command  installs the file directly in
the  INSTALL_TO/file.  An  /app/  is a  script  or other  executable,
whereas a  /bin/ is really  a shell  library.  The /lib/  directive is
reserved for  future expansion  where a  file may  need to  be linked,
moved, or copied to the run-time environment's ~/lib~ directory.

*** the commands

If using both /combine/ and /install/ features, from the parent directory
from the _INC and _SRC directories, then:

: $ source combinelib # once in the terminal session, and 
:   ...               # anytime later
: $ install_combine   # installs the combine result

Or if just using the installation by itself

: $ install_one  name # from name.install

** conventions

Some conventions are required:

+ OrgMode files for combining are tangled to the local *./inc*, 
  the default COMBINE_FROM directory.  Here's an example:

   : #+BEGIN_SRC sh :tangle ./inc/stack.0

+ the installation location is
    - INSTALL_TO
    - an existing executable file on the user's PATH
    - HOME/bin
    - if neither exist prior to installation, they are created just in
      time.

+ the command

  : $ install_combine

does the  combining and  installing, given appropriate  file fragments
and install scripts.   There may be multiple  installations per source
directory.  On  the other hand.   Since there is only  one destination
base per  install file, multiple  installation targets may  be managed
from the same sources.   See the customization below.


+ master files have a unique suffix, COMBINE_SUF, defaulting to  *all*

+ the combined product has a unique suffix, COMBINE_OUT, defaulting to
  *out*

+ in all cases, the suffix for error files (stderr) is *.err*

+ there is  no requirement (other than good taste)  on other prefix or
  suffix names.  In  this sense, "good taste" includes  the concept of
  no spaces in a file name

* Combine Code
 
The /combine/ code comes in two pieces:

1. the workhorse  is the *include* script,  which recursively includes
   named file fragments into a master file.

1.  a  small  function   family:  *combinelib*,  providing  name-space
   management with shell variables while wrapping the include process.

** installation

This fragment combines (!) the /combine/ and /install/ families into a
single library  *combinelib*.  Since a  first-time user will  not have
the  library  already  installed, the  simple  bootstrap  instructions
follow, which should add to one's appreciation of the method.

The ~install_bin~  command anticipates  an output  file: /combine.out/
and looks  for or  creates a  *bin* directory  to hold  the executable
*combinelib*

Moreover,  this  distribution includes  a  copy  of necessary  utility
functions from the [[http://mcgowans.org/marty3/commonplace/software/shelf.html][SHELF]] Standard.  At some glorious future date, this
will incorporate sourcing that library,  rather than having copied its
code, as a prerequisite.

#+BEGIN_SRC sh :tangle ./src/combine.install :comments both :padline no
    install_bin combine
    install_app include
#+END_SRC

** include

The include script.  Look for an /iawk/ or [[https://www.mankier.com/1/igawk][gawk]] reference on the web.
The simple syntax is:
: @include filename
and it is recursive.   

This file needs no combining.  It is a shell script.

#+BEGIN_SRC sh :tangle ./inc/include.all :comments both :padline no
# 
cat ${*:--} | awk '

BEGIN   { stderr = "/dev/stderr"
          logfil = "include.not"
          errfmt = "TRACE include.%s(%s)\n"
}
function this_line (res) {

    printf "%3d %d %s\n", NF, res, $0 > stderr
    return res
}
function with_file (file) {

    printf errfmt, "with_file", file > stderr
    if (this_line( (getline line < file) == -1 )) {

        printf "needfile %s\n", file > logfil
        print
    } else {

        # side effect, "file" is opened, so,
        # close it to be able to read it:
        close(file)

        printf errfmt, "about to INCLUDE", file > stderr
        system( "include " file)
    }
    # and since we may have just read it, close it again 
    # if we opened it, or for the first time if we did not.
    # why? an app may include a file more than once.
    close(file)
}
function may_include() {

   # printf errfmt, "may_include", ""  > stderr
   # HTML Comment, replace with     7/26/15, mcgowan@alum.mit.edu
   # return this_line($1 == "<!--" && $2=="include" && $4 == "-->")
   # iawk-style include, not bound simply awk programs

     return this_line($1 ~ /^@include$/)
}
     {
        if ( may_include() ) { 
            # with_file( $3 ), ex  7/26/15
            # e.g.  @include filename
            with_file( $2 )
            next
        }
      }
NF    {
         print 
      }
'
#+END_SRC

** combine family
The *combinelib*  is built in  a few  pieces.  First is  the copyright
notice and an entry-point, main function.
*** combine_mk

This is the top /combine/ function.
#+BEGIN_SRC sh :tangle ./inc/combine.0 :comments both :padline no
  copyright_combine () 
  { 
      comment "Copyright (C) 2016, JYATL - Just Yet Another Testing Lab";
      comment "mailto: mcgowan (at) alum DOT mit DOT edu";
  }
  combine_mk () 
  { 
      : SRC and INC are preferably sibling directories
      : he OrgMode TANGLE puts fragments w/o any sense of changed or not;
      : run from the INC directory, 
      : this combines the SUF files, putting changed files in SRC

      local combine_to=$(cd $COMBINE_TO; pwd)

      pushd ${COMBINE_FROM}
      for f in *.${COMBINE_SUF};
      do
          mv_orrm $(combine_bunch $f) $combine_to
      done;
      popd
  }
#+END_SRC

The *combine_bunch* function leaves it's output on ~stdout~, where it's
used as the file-name argument to *mv_orrm* (move or remove) to the second,
directory argument.

