inc/combine.0
# combine_mk

# This is the top /combine/ function.
# [[file:~/git/shelf/combine.org::*combine_mk][combine_mk:1]]
copyright_combine () 
{ 
    comment "Copyright (C) 2016, JYATL - Just Yet Another Testing Lab";
    comment "mailto: mcgowan (at) alum DOT mit DOT edu";
}
combine_mk () 
{ 
    : SRC and INC are preferably sibling directories
    : he OrgMode TANGLE puts fragments w/o any sense of changed or not;
    : run from the INC directory, 
    : this combines the SUF files, putting changed files in SRC

    local combine_to=$(cd $COMBINE_TO; pwd)

    pushd ${COMBINE_FROM}
    for f in *.${COMBINE_SUF};
    do
        mv_orrm $(combine_bunch $f) $combine_to
    done;
    popd
}
# combine_mk:1 ends here
