combine.org
*** combine functions

This is the remainder of the *combinelib* function library.

Other, copied utility functions follow.

The manual procedure to collect those functions is also being
formalized with functions and a library.

#+BEGIN_SRC sh :tangle ./inc/combine.1 :comments both :padline no
  combine_bunch ()
  {      
      : ~ file.SUF
      report_notcalledby combine_mk && return 1
      report_notargcount 1 $# {file}.${COMBINE_SUF} && return 2;
      report_notfile $1 && return 3;
      set ${1%.*}.{${COMBINE_SUF},${COMBINE_OUT},err}

      trace_call $*

      combine_include $* &&   echo $2
      ls -lrt $* 1>&2

  }
  mv_orrm  ()   
  { 

         report_notargcount 2 $# && return 1
         trace_call $*
         mv_ifdiff $1 $2/$1
         [[ -f $1 ]] && rm -f $1
  }
  mv_ifdiff () 
  { 
      report_notfile $1 && return 1 
      : mv 1 to 2 if files DONT compare;
      trace_call $*;
      touch $2;
      cmp $1 $2 > /dev/null || mv $1 $2
  }
  combine_include () 
  {
       : ~ INPUT Output Error
       : fails if "include.not" has data, the ERR is the fence.
       report_notargcount 3 $# Input Output Error tmp && return 1
       report_notfile $1 && return 2
       trace_call $*
       rm -f include.not
       include $1 2>$3 >$2
       
       [[ -s include.not ]] && { 
            rm -f $3
            cat include.not 1>&2
            return 3
       }
       return 0
  }
  combine_init () 
  { 
      trace_call $*;
      om_iam;
      : ${COMBINE_FROM:=./inc}
      : ${COMBINE_TO:=./src}
      : ${COMBINE_SUF:=all}
      : ${COMBINE_OUT:=out}
      install_init
  }
#+END_SRC

*** combine combined
#+BEGIN_SRC sh :tangle ./inc/combine.all :comments both :padline no
@include combine.0
@include combine.1
@include install.0
@include install.1
@include install.2
combine_init 1>&2
#+END_SRC

While this is a good rule, occasionally it may be broken.

: each file should have one syntax, either include or script.

* Install Code

The  /install/ family  is  initially installed  here  by a  boot-strap
process.  Failing to find an already installed library or application,
this installation  creates an  *INSTALL_TO* directory,  defaulting to
~HOME/bin~ if it doesn't exist, otherwise links the executable library
or application to that directory.

Since  this process  now adheres  to  the combining  process, it  uses
conventions established there, and adds just a few of its own.

** install installation

Install  is now  part  of the  /combine/ family;  it  has no  separate
installer.   And its  combining is  done together  with the  /combine/
family as part of the *combinelib*.

One's work should  always have a large  [[https://en.wikipedia.org/wiki/Chicken_or_the_egg][chicken-or-egg]] component.  So,
the bootstrap process to install the installation code is:

** testboot.sh
#+BEGIN_SRC sh :tangle ./testboot.sh 

# --------- while testing in the same shell, clean up residuals	--

unset $(
    set | awk -F= '     \
          $1 ~ /^COMBINE_/ ||   \
               /^combine/  ||   \
               /^install/  { sub(/[(][)]/," "); print $1 }

          '
      ) 

. ./bootstrap.sh


#+END_SRC
** bootstrap.sh
#+BEGIN_SRC  sh :tangle ./bootstrap.sh 

#  ------------------------- preserve the original PATH	--

: ${OPATH:=$PATH}

# -------------------------------- development defaults	--

#  EDIT to suit your Needs
COMBINE_FROM=./inc
COMBINE_TO=./src
COMBINE_SUF=all
COMBINE_OUT=out
INSTALL_TO=$HOME/Dropbox/bin

pushd $COMBINE_FROM

    # ---------------------------- source the fragments	--

    combine_inc=$(pwd)
    
    for file in {install,combine}.?;  do
       [[ -f $file ]] || continue
       . $file
       echo === $file ===
    done
    
   # --------------------- here is a bootstrap INCLUDE	--

    ln -f include.all include
    chmod +x include
   
   # ------------------------------ put it on the PATH	-- 

    PATH=$combine_inc:$OPATH
popd
# ------------------------------------- simulate Source	--

combine_init
# --------------------------------- do the installation	--

install_combine
# ------------------------ remove the bootstrap include	--

rm -f $combine_inc/include
# ------------------------------------ restore the PATH	--

PATH=$INSTALL_TO:$OPATH

#+END_SRC
** instructions
1. since this  is maintained in emacs OrgMode, tangle  this file: 
   : ~C-c C-v C-t~ 
   which dumps these contents into the *inc* directory
1. inspect, if  necessary, edit the bootstrap  script, particularly to
   set the  location of the INC  and SRC directories, the  SUF and OUT
   file suffixes, corresponding to your own choices.  
1. from the shell, do the bootstrap combining
   : . ./bootstrap.sh
   creates  *.out* files  from *.all*  and sources  workable functions
   into the current shell
1. you are instructed to run this command, which you may do at will.
   : $ compile_install

This may have to be repeated as functions are added here.  Routinely, 
the installation here, as elsewhere is, after tangling:

: $ combine_mk
: $ indir src source {libname}.install

is now shortened to:

: $ install_combine

The  combining  facets  have  been  factored out.   The  code  in  the
COMBINE_FROM  directory  may   be  treated  as  the   native,  raw,  or
version-controlled components.  This requires accommodations:

1.  ability  to  re-target  or  re-host  the  tangled  code  has  been
   accomplished  by  use  of  the COMBINE_FROM  and  COMBINE_TO  shell
   variables.

1. separate any wrong-way tools connections from a *combinelib* and an
   *installlib*.   Either  that,  or  combine  the  two  libraries  as
   families in a single lib.

Once manually  installed, the re-installation script  is the prototype
for any  other tangled code.   This installation format  also respects
the second requirement above.

*** install install

** Install Code

The ~install_combine~ function  is only useful for code,  such as this
which has  been produced from either  an OrgMode tangle process  OR by
any other text editor where  the development environment has access to
the [[../combine/combine.org][combinelib]].   The products  of the  ~combine_all~ step  become the
general user source view of the components.

*** User Functions
#+BEGIN_SRC sh :tangle ./inc/install.0 :comments both :padline no
  copyright_install ()
  { 
      comment "Copyright (C) 2016, JYATL - Just Yet Another Testing Lab";
      comment "mailto: mcgowan (at) alum DOT mit DOT edu";
  }
install_app () 
{
    install_executable $1.$INSTALL_SRC $1
}
install_bin () 
{ 
    install_executable $1.$INSTALL_SRC ${1}lib
}
install_one () 
{
    : ~ handle
    report_notargcount 1 $# handle               && return 1
    report_notfile $INSTALL_FROM/$1.$INSTALL_CMD && return 2

    indir $INSTALL_FROM . $1.$INSTALL_CMD
}
install_combine () 
{
    : ~ 
    : from the package directory
    : 
    combine_mk
    pushd $INSTALL_FROM >/dev/null  
    : installation instructions
    for ins in *.$INSTALL_CMD; do . $ins; done
    popd > /dev/null
}
#+END_SRC

*** Family Functions

#+BEGIN_SRC sh :tangle ./inc/install.1 :comments both :padline no
file_append ()    { local file=$1; shift; $@ >> $file; }
install_duplog () { ${*:-echo}  $(needir $HOME/lib)/duplicateWhich.log; }
install_executable () 
{
    chmod +x $1
    : defend against multiple "which"s
    set $1 $(install_needex ${2:-${1}lib})
    [[ $# -gt 2 ]] && { 
          file_append $(install_duplog) echo install_executable $*
    }
    doit ln  -f $1 $2 1>&2
}
install_needex () 
{
    : ~ file
    : return name of INSTALL_TO/file, if the variable is set,
    : ...     or if previously installed, return {which file}
    : ...     or HOME/bin/file.
    : the directories are created if needed

    report_notargcount 1 $# possible executable && return 1
    trace_call $*

    [[ -n "$INSTALL_TO" ]] && {

        echo $(needir $INSTALL_TO)/$1
        return
    }
    
    which $1 && return

    echo $(needir $HOME/bin)/$1 
   
}
install_init ()
{
    : INSTALL_FROM defaults either to COMBINE_TO, or "./src"
    : carefully note that INSTALL_FROM is set if not yet, while
    : COMBINE_TO is NOT gratuitously set.  ":=" vs ":-"
    : similarly for the INSTALL_SRC and COMBINE_OUT suffixes.
    : ------------------------------------- directories	--
    : ${INSTALL_FROM:=${COMBINE_TO:-./src}}
    : ${INSTALL_TO:=""}
    : ------------------------------------- file suffix	--
    : ${INSTALL_SRC:=${COMBINE_OUT:-out}}
    : ${INSTALL_CMD:=install}

    om_iam
}
#+END_SRC
