inc/combine.1
# combine functions

# This is the remainder of the *combinelib* function library.

# Other, copied utility functions follow.

# The manual procedure to collect those functions is also being
# formalized with functions and a library.
# [[file:~/git/shelf/combine.org::*combine%20functions][combine\ functions:1]]
combine_bunch ()
{      
    : ~ file.SUF
    report_notcalledby combine_mk && return 1
    report_notargcount 1 $# {file}.${COMBINE_SUF} && return 2;
    report_notfile $1 && return 3;
    set ${1%.*}.{${COMBINE_SUF},${COMBINE_OUT},err}

    trace_call $*

    combine_include $* &&   echo $2
    ls -lrt $* 1>&2

}
mv_orrm  ()   
{ 

       report_notargcount 2 $# && return 1
       trace_call $*
       mv_ifdiff $1 $2/$1
       [[ -f $1 ]] && rm -f $1
}
mv_ifdiff () 
{ 
    report_notfile $1 && return 1 
    : mv 1 to 2 if files DONT compare;
    trace_call $*;
    touch $2;
    cmp $1 $2 > /dev/null || mv $1 $2
}
combine_include () 
{
     : ~ INPUT Output Error
     : fails if "include.not" has data, the ERR is the fence.
     report_notargcount 3 $# Input Output Error tmp && return 1
     report_notfile $1 && return 2
     trace_call $*
     rm -f include.not
     include $1 2>$3 >$2
     
     [[ -s include.not ]] && { 
          rm -f $3
          cat include.not 1>&2
          return 3
     }
     return 0
}
combine_init () 
{ 
    trace_call $*;
    om_iam;
    : ${COMBINE_FROM:=./inc}
    : ${COMBINE_TO:=./src}
    : ${COMBINE_SUF:=all}
    : ${COMBINE_OUT:=out}
    install_init
}
# combine\ functions:1 ends here
