combine.org
*** COMMENT Utility Functions
#+BEGIN_SRC sh :tangle ./inc/install.2 :comments both :padline no
comment () 
{ 
    echo $* 1>&2
}
doit () 
{ 
    echo $* 1>&2;
    $*
}
indir () 
{ 
    report_notdirectory $1 && return 1;
    ignore pushd $1;
    shift;
    eval $@;
    ignore popd
}
fun_from () 
{ 
    trace_call $*;
    : reconcile patterns to fuse;
    cat ${*:--} | awk ' 
        $2 ~ /^\(\)$/     { print $1 } 
             /^function / { print $2 }
    '
}
functions () 
{ 
    trace_call $*;
    fun_from $* | printfirst
}
isfunction () 
{ 
    trace_call $*;
    declare -f $1 > /dev/null
}
myname () 
{ 
    echo ${FUNCNAME[${1:-1}]}
}
needir () 
{ 
    trace_call $*;
    [[ -d $1 ]] || mkdir -p $1;
    echo $1
}
om_generic () 
{ 
    : ~ fun { sub arg ... };
    : preferably executes FUN_SUB arg ...;
    : or FUN_HELP;
    : ====================================;
    local fun=$1;
    shift;
    : only when a function is first use thru the model;
    declare -f ${fun}_firsttime > /dev/null && ${fun}_firsttime;
    [[ $# -lt 1 ]] && { 
        ${fun}_help 2> /dev/null;
        return
    };
    local f=${fun}_$1;
    shift;
    declare -f $f > /dev/null 2>&1 || { 
        ${fun}_help 2> /dev/null;
        return
    };
    $f $*
}
om_iam () 
{ 
    : user identifies themself as an OM object;
    set $(myname 2);
    set ${1%_init};
    report_notcalledby ${1}_init && return 1;
    : create the OM function;
    eval "$1 () { om_generic $1 \$*; }";
    : every family has a list of members;
    local l=${1}_list;
    declare -f $l > /dev/null 2>&1 || { 
        eval "$l () { (sfg ^${1}_; sfg _${1}$) 2>/dev/null; }"
    };
    : every family may have shell varialbles;
    local v=${1}_vars;
    local V=$(UC $1);
    declare -f $v > /dev/null 2>&1 || { 
        eval "$v () { set | grep ^${V}_ 2>/dev/null; }"
    };
    : and a default help function when one doesnt exist;
    local h=${1}_help;
    declare -f $h > /dev/null 2>&1 || { 
        eval "$h () { echo $1 functions, variables:; ($v; $l) | sed 's/^/  /'; }"
    };
    : shows Copyright when library is sourced.;
    local f=${1}_firsttime;
    eval "$f () { copyright_${1}; unset $f; }";
    : and displays the help;
    ${1}_help
}
printfirst () 
{ 
    trace_call $*;
    awk '!printed [$1]++' $*
}
qmoved () 
{ 
    [ "$PWD" == "${1:-$PWD}" ] && return;
    echo MOVED to $PWD
}
report_notargcount () 
{ 
    [[ $2 -ge $1 ]] && return 1;
    report_usage need at least $1 arg/s: $(shift 2; echo $*)
}
report_notcalledby () 
{ 
    set ${1:-/dev/null} $(myname 3) non-Existant-function;
    [[ $2 == $1 ]] && return 1;
    report_usage was NOT called by $1.
}
report_notfile () 
{ 
    [[ -f $1 ]] && return 1;
    report_usage $1 is NOT a file
}
report_usage () 
{ 
    comment USAGE $(myname 3): $*
}
setenv () 
{ 
    [[ $# -lt 1 ]] && return;
    local na=$1;
    shift;
    eval $na=\"$*\";
    export $na
}
sfg () 
{ 
    trace_call $*;
    set | functions | grep -i ${*:-.}
}
trace_call () 
{ 
    trace_stderr "$@"
}
trace_off () 
{ 
    eval "trace_call () { return; }";
    trace_set trace_off trace_on
}
trace_on () 
{ 
    eval "trace_call () { trace_stderr \"\$@\"; }";
    trace_set trace_on trace_off
}
trace_set () 
{ 
    case $1.$2 in 
        trace_on.trace_off | trace_off.trace_on)
            setenv TRACE_STATE ${1};
            setenv TRACE_NOT ${2}
        ;;
        trace_on.*)
            trace_set $1 trace_off
        ;;
        trace_off.*)
            trace_set $1 trace_on
        ;;
    esac
}
trace_stderr () 
{ 
    pa=${FUNCNAME[2]:-COMMANDLINE};
    gr=${FUNCNAME[3]:-COMMANDLINE};
    printf "TRACE %s\t@ %s %d  ( %s )\n" "$pa" "$gr" $# "$*" 1>&2
}

#+END_SRC

* User Customization
A user who wants to customize the COMBINE variables need only assign
them before sourcing the ~combinelib~, for example:
#+BEGIN_EXAMPLE

    COMBINE_FROM=../include
    COMBINE_TO=../src
    COMBINE_SUF=txt       # no "." in suffix names
    COMBINE_OUT=out       # same as default for clarity
    source combineline    # new variables apply
   
#+END_EXAMPLE

* Reported errors

+ combine_mk
    1. internal function called manually
    1. internal function called with insufficient arguments
    1. internal function called with non-file argument

+ include
    1. writes list of un-found files in the *include.not* file

* Rationale

These  functions were  originally built  to simplify  the products  of
/tangling/, or [[http://orgmode.org/org.html#Specific-header-arguments][extracting source code]] from an OrgMode source file.  As
an example  of *combinelib* usage,  an emacs user /tangles/  this file
into all  the other file  fragments needed to ~combine~  and ~install~
the  function  families.  

With the  idea of  sharing on  [[http://github.com/applemcg/combine][Github: applemcg/combine]],  then tangled
fragments had  to fit a  generally-accessible framework. Thus  was born
the notion of the directory and file-suffix naming conventions.

While /tangle/ files are always overwritten, not every /combined/ file
may change.  The modification time  on a COMBINE_OUT file is unchanged
if its contents are unchanged.

Originally the two families were  separate libraries.  I combined them
for a few reasons:

1. to test the notion a library with a single function family may join
   with another, closely related family.
1. to  discover how difficult it  was to add seams:  here for example,
   rather than have  a single name for the products  of combination to
   be stuff to install, split the  name to allow use of either package
   without  the  other.   specifically have  INSTALL_FROM  default  to
   COMBINE_TO.
1.  to  eliminate redundant  use  of  many  functions from  the  [[http://mcgowans.org/marty3/commonplace/software/shelf.html][SHELF
   Standard]].   And  this motivates  a  piece  of  the practice:  in  a
   library-rich  environment,  have  a  process  which  picks  up  the
   disparate functions into a  single library or application depending
   on  no other  function  libraries, and  needs only  system-supplied
   tools.  Tools to do this discovery are in *applib*

And I've discovered a saying: /It takes two to TANGLE/


* COMMENT Lessons 						     :tangle:

I've learned, of historical note, and needs revision.

With this file, I've learned how to have code live with it's documentation, and
almost install it.  That lesson awaits understanding how to hang a "hook" while
[[http://orgmode.org/manual/Extracting-source-code.html#Extracting-source-code][extracting the source code]].  

Here are the steps I go thru:
1. edit the code or it's documentation. (may use C-c ' in a code block),
1. "tangle" the code block(s) -- see the link above, which ship the code off
   to it's place to live.
1. execute the 'installation' instructions below. these are only 
   in the Org file, since they're hidden from the HTML output.
   alternatively, do the same thing from a terminal window, where
   the commands may be tested independently of emacs/OrgMode.

Hanging the hook: /org-babel-post-tangle-hook/ promises to allow
post-processing, i.e. making the ../bin files executable and linking
the text files to the adjacent ../lib directory.

And, just maybe, this should become the ASSERTlib, change every instance
of report_ to assert_?

* COMMENT Commands

** information

: $ combine_all
: $ indir .untangle . tangle.install

OR
: $ install_tangle

and remember tangle command : C-c C-v t

* References

1. [[http://mcgowans.org/marty3/commonplace][Commonplace Book]], of Marty McGowan
   http://mcgowans.org/marty3/commonplace

1. [[http://mcgowans.org/marty3/commonplace/software/shelf.html][SHELF Standard]].
   http://mcgowans.org/marty3/commonplace/software/shelf.html

1. [[https://github.com/applemcg/combine][Github combinelib Repo]]
   https://github.com/applemcg/combine

